app/controllers/assets_controller.rb

SELECT "assets".* FROM "assets"
---
  def index
    @assets = Asset.all

INSERT INTO "assets" ("url", "moodboard_id", "created_at", "updated_at", "x_position", "y_position", "width", "height") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @asset = Asset.new(asset_params)

    if @asset.save

UPDATE "assets" SET "x_position" = $1, "y_position" = $2, "updated_at" = $3 WHERE "assets"."id" = $4  [["x_position", 318.0], ["y_position", 158.0], ["updated_at", 2017-02-22 13:12:34 UTC], ["id", 24]]
---
  def update
    if @asset.update(asset_params)

DELETE FROM "assets" WHERE "assets"."id" = $1  [["id", 4]]
---
  def destroy
    @asset.destroy

SELECT  "assets".* FROM "assets" WHERE "assets"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
---
    def set_asset
      @asset = Asset.find(params[:id])