app/controllers/moodboards_controller.rb

SELECT "moodboards".* FROM "moodboards"
---
  def index
    @moodboards = Moodboard.all

INSERT INTO "moodboards" ("project_name", "brief", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["project_name", "blur"], ["brief", "yep"], ["user_id", 7], ["created_at", 2017-02-20 19:50:43 UTC], ["updated_at", 2017-02-20 19:50:43 UTC]]
---
  def create
    @moodboard = Moodboard.new(moodboard_params)

    if @moodboard.save

DELETE FROM "moodboards" WHERE "moodboards"."id" = $1  [["id", 2]]
---
  def destroy
    @moodboard.destroy

SELECT  "moodboards".* FROM "moodboards" WHERE "moodboards"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_moodboard
      @moodboard = Moodboard.find(params[:id])